GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_shrtimer.c
/*!
    \file    gd32a508_shrtimer.c
    \brief   SHRTIMER driver

    \version 2025-08-08 V1.3.0, firmware for GD32A508
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32a508_shrtimer.h"

/* SHRTIMER related parameter mask */
#define CNTCKDIV2_0_MASK  (uint32_t)(0x00000007)
#define CNTCKDIV3_MASK  (uint32_t)(0x00000008)
#define STX_UPDATESOURCE_MASK (SHRTIMER_STXCTL0_UPBST0 | SHRTIMER_STXCTL0_UPBST1 | SHRTIMER_STXCTL0_UPBST2 | SHRTIMER_STXCTL0_UPBST3 | SHRTIMER_STXCTL0_UPBST4 | SHRTIMER_STXCTL0_UPBMT)
#define STX_FAULTCH_MASK (SHRTIMER_STXFLTCTL_FLT0EN | SHRTIMER_STXFLTCTL_FLT1EN | SHRTIMER_STXFLTCTL_FLT2EN | SHRTIMER_STXFLTCTL_FLT3EN | SHRTIMER_STXFLTCTL_FLT4EN)

/* configure Master_TIMER timer base */
static void master_timer_base_config(uint32_t shrtimer_periph, shrtimer_baseinit_parameter_struct* master_baseinit);
/* configure Master_TIMER in waveform mode  */
static void master_timer_waveform_config(uint32_t shrtimer_periph, shrtimer_timerinit_parameter_struct * master_timerinit);
/* configure Slave_TIMER timer base */
static void slave_timer_base_config(uint32_t shrtimer_periph, uint32_t slave_id, shrtimer_baseinit_parameter_struct* slave_baseinit);
/* configure Slave_TIMER in waveform mode  */
static void slave_timer_waveform_config(uint32_t shrtimer_periph, uint32_t slave_id, shrtimer_timerinit_parameter_struct * slave_timerinit);
/* configure the an external event channel */
static void external_event_config(uint32_t shrtimer_periph, uint32_t event_id, shrtimer_exeventcfg_parameter_struct* eventcfg);
/* configure the channel output  */
static void channel_output_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t channel, shrtimer_channel_outputcfg_parameter_struct * outcfg);

/*!
    \brief      deinit a SHRTIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[out] none
    \retval     none
*/
void shrtimer_deinit(uint32_t shrtimer_periph)
{
    switch(shrtimer_periph){
    case SHRTIMER0:
        /* reset SHRTIMER0 */
        rcu_periph_reset_enable(RCU_SHRTIMERRST);
        rcu_periph_reset_disable(RCU_SHRTIMERRST);
        break;
    default:
    break;
    }
}

/*!
    \brief      configure and start DLL calibration
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  calform: specify the calibration form
                only one can be selected which is shown as below:
      \arg          SHRTIMER_CALIBRATION_ONCE: DLL calibration start once
      \arg          SHRTIMER_CALIBRATION_1048576_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 1048576 * tSHRTIMER_CK
      \arg          SHRTIMER_CALIBRATION_131072_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 131072  * tSHRTIMER_CK
      \arg          SHRTIMER_CALIBRATION_16384_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 16384  * tSHRTIMER_CK
      \arg          SHRTIMER_CALIBRATION_2048_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 2048 * tSHRTIMER_CK
    \param[out] none
    \retval     none
*/
void shrtimer_dll_calibration_start(uint32_t shrtimer_periph, uint32_t calform)
{
    uint32_t dllcctl_reg;

    /* configure DLL calibration */
    dllcctl_reg = SHRTIMER_DLLCCTL(shrtimer_periph);
  
    if (SHRTIMER_CALIBRATION_ONCE == calform){
        /* DLL periodic calibration disable */
        dllcctl_reg &= ~(SHRTIMER_DLLCCTL_CLBPEREN);
        dllcctl_reg |= SHRTIMER_DLLCCTL_CLBSTRT;    
    }else{
        /* DLL periodic calibration enable */
        dllcctl_reg &= ~(SHRTIMER_DLLCCTL_CLBPER | SHRTIMER_DLLCCTL_CLBSTRT);
        dllcctl_reg |= (calform | SHRTIMER_DLLCCTL_CLBPEREN);
    }
    
    SHRTIMER_DLLCCTL(shrtimer_periph) = dllcctl_reg;
}

/*!
    \brief      initialize SHRTIMER time base parameters struct with a default value 
    \param[in]  baseinit: SHRTIMER time base parameters struct
    \param[out] none
    \retval     none
*/
void shrtimer_baseinit_struct_para_init(shrtimer_baseinit_parameter_struct* baseinit)
{
    baseinit->counter_mode = SHRTIMER_COUNTER_MODE_SINGLEPULSE;
    baseinit->period = 0xFFDFU;
    baseinit->prescaler = SHRTIMER_PRESCALER_MUL32;
    baseinit->repetitioncounter = 0x00U;
}

/*!
    \brief      initialize Master_TIMER and Slave_TIMER timerbase 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  baseinit: SHRTIMER time base parameters struct
                  period: period value, min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF - (1*tSHRTIMER_CK)
                  repetitioncounter: the counter repetition value, 0x00~0xFF
                  prescaler: SHRTIMER_PRESCALER_MULy(y=64,32,16,8,4,2), SHRTIMER_PRESCALER_DIVy(y=1,2,4)
                  counter_mode: SHRTIMER_COUNTER_MODE_CONTINOUS, SHRTIMER_COUNTER_MODE_SINGLEPULSE, SHRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE
    \param[out] none
    \retval     none
*/
void shrtimer_timers_base_init(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_baseinit_parameter_struct* baseinit)
{
    if(SHRTIMER_MASTER_TIMER == timer_id)
    {
        /* configure Master_TIMER timer base */
        master_timer_base_config(shrtimer_periph, baseinit);
    }else{
        /* configure Slave_TIMER timer base */
        slave_timer_base_config(shrtimer_periph, timer_id, baseinit);
    }
}

/*!
    \brief      enable a counter
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  cntid: specify the counter to configure
                only one can be selected which is shown as below:
      \arg          SHRTIMER_MT_COUNTER: the counter of Master_TIMER
      \arg          SHRTIMER_ST0_COUNTER: the counter of Slave_TIMER0
      \arg          SHRTIMER_ST1_COUNTER: the counter of Slave_TIMER1
      \arg          SHRTIMER_ST2_COUNTER: the counter of Slave_TIMER2
      \arg          SHRTIMER_ST3_COUNTER: the counter of Slave_TIMER3
      \arg          SHRTIMER_ST4_COUNTER: the counter of Slave_TIMER4
    \param[out] none
    \retval     none
*/
void shrtimer_timers_counter_enable(uint32_t shrtimer_periph, uint32_t cntid)
{
    SHRTIMER_MTCTL0(shrtimer_periph) |= cntid;
}

/*!
    \brief      disable a counter
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  cntid: specify the counter to configure
                only one can be selected which is shown as below:
      \arg          SHRTIMER_MT_COUNTER: the counter of Master_TIMER
      \arg          SHRTIMER_ST0_COUNTER: the counter of Slave_TIMER0 
      \arg          SHRTIMER_ST1_COUNTER: the counter of Slave_TIMER1 
      \arg          SHRTIMER_ST2_COUNTER: the counter of Slave_TIMER2 
      \arg          SHRTIMER_ST3_COUNTER: the counter of Slave_TIMER3 
      \arg          SHRTIMER_ST4_COUNTER: the counter of Slave_TIMER4 
    \param[out] none
    \retval     none
*/
void shrtimer_timers_counter_disable(uint32_t shrtimer_periph, uint32_t cntid)
{
    SHRTIMER_MTCTL0(shrtimer_periph) &= ~(cntid);
}

/*!
    \brief      enable the Master_TIMER or Slave_TIMER update event
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[out] none
    \retval     none
*/
void shrtimer_timers_update_event_enable(uint32_t shrtimer_periph, uint32_t timer_id)
{
    switch(timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
            /* enable the Master_TIMER update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_MTUPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER0:
            /* enable the Slave_TIMER0 update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_ST0UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER1:
            /* enable the Slave_TIMER1 update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_ST1UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER2:
            /* enable the Slave_TIMER2 update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_ST2UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER3:
            /* enable the Slave_TIMER3 update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_ST3UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER4:
            /* enable the Slave_TIMER4 update event */
            SHRTIMER_CTL0(shrtimer_periph) &= ~SHRTIMER_CTL0_ST4UPDIS;
        break;
        default:
        break;  
    }
}

/*!
    \brief      disable the Master_TIMER or Slave_TIMER update event
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[out] none
    \retval     none
*/
void shrtimer_timers_update_event_disable(uint32_t shrtimer_periph, uint32_t timer_id)
{
    switch(timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
            /* disable the Master_TIMER update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_MTUPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER0:
            /* disable the Slave_TIMER0 update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_ST0UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER1:
            /* disable the Slave_TIMER1 update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_ST1UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER2:
            /* disable the Slave_TIMER2 update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_ST2UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER3:
            /* disable the Slave_TIMER3 update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_ST3UPDIS;
        break;
        case SHRTIMER_SLAVE_TIMER4:
            /* disable the Slave_TIMER4 update event */
            SHRTIMER_CTL0(shrtimer_periph) |= SHRTIMER_CTL0_ST4UPDIS;
        break;
        default:
        break;  
    }
}

/*!
    \brief      trigger the Master_TIMER and Slave_TIMER registers update by software
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timersrc: which timer to be update by software
                only one can be selected which is shown as below:
      \arg         SHRTIMER_UPDATE_SW_MT: Master_TIMER software update
      \arg         SHRTIMER_UPDATE_SW_ST0: Slave_TIMER0 software update
      \arg         SHRTIMER_UPDATE_SW_ST1: Slave_TIMER1 software update
      \arg         SHRTIMER_UPDATE_SW_ST2: Slave_TIMER2 software update
      \arg         SHRTIMER_UPDATE_SW_ST3: Slave_TIMER3 software update
      \arg         SHRTIMER_UPDATE_SW_ST4: Slave_TIMER4 software update
    \param[out] none
    \retval     none
*/
void shrtimer_software_update(uint32_t shrtimer_periph, uint32_t timersrc)
{
    SHRTIMER_CTL1(shrtimer_periph) |= timersrc;
}

/*!
    \brief      reset the Master_TIMER and Slave_TIMER counter by software 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timerrst: which timer to be reset by software
                only one can be selected which is shown as below:
      \arg         SHRTIMER_COUNTER_RESET_SW_MT: Master_TIMER software reset
      \arg         SHRTIMER_COUNTER_RESET_SW_ST0: Slave_TIMER0 software reset  
      \arg         SHRTIMER_COUNTER_RESET_SW_ST1: Slave_TIMER1 software reset
      \arg         SHRTIMER_COUNTER_RESET_SW_ST2: Slave_TIMER2 software reset
      \arg         SHRTIMER_COUNTER_RESET_SW_ST3: Slave_TIMER3 software reset
      \arg         SHRTIMER_COUNTER_RESET_SW_ST4: Slave_TIMER4 software reset
    \param[out] none
    \retval     none
*/
void shrtimer_software_counter_reset(uint32_t shrtimer_periph, uint32_t timerrst)
{
    SHRTIMER_CTL1(shrtimer_periph) |= timerrst;
}

/*!
    \brief      initialize waveform mode initialization parameters struct with a default value
    \param[in]  timerinitpara: SHRTIMER waveform mode initialization parameters
    \param[out] none
    \retval     none
*/
void shrtimer_timerinit_struct_para_init(shrtimer_timerinit_parameter_struct* timerinit)
{
    timerinit->cnt_bunch = SHRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK;
    timerinit->dac_trigger = SHRTIMER_DAC_TRIGGER_NONE;
    timerinit->half_mode = SHRTIMER_HALFMODE_DISABLED;
    timerinit->repetition_update = SHRTIMER_UPDATEONREPETITION_DISABLED;
    timerinit->reset_sync = SHRTIMER_SYNCRESET_DISABLED;
    timerinit->shadow = SHRTIMER_SHADOW_DISABLED;
    timerinit->start_sync = SHRTIMER_SYNISTART_DISABLED;
    timerinit->update_selection = SHRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT;
}

/*!
    \brief      initialize a timer to work in waveform mode 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  timerinitpara: SHRTIMER waveform mode initialization parameters
                  half_mode: SHRTIMER_HALFMODE_DISABLED, SHRTIMER_HALFMODE_ENABLED
                  start_sync: SHRTIMER_SYNISTART_DISABLED, SHRTIMER_SYNISTART_ENABLED
                  reset_sync: SHRTIMER_SYNCRESET_DISABLED, SHRTIMER_SYNCRESET_ENABLED
                  dac_trigger: SHRTIMER_DAC_TRIGGER_NONE, SHRTIMER_DAC_TRIGGER_DACTRIGy(y=0..2)
                  shadow: SHRTIMER_SHADOW_DISABLED, SHRTIMER_SHADOW_ENABLED
                  update_selection: SHRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT, for Master_TIMER and Slave_TIMER
                                    SHRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE, for Master_TIMER and Slave_TIMER
                                    SHRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE, for Master_TIMER and Slave_TIMER
                                    SHRTIMER_ST_UPDATE_SELECTION_STXUPINy(y=2), for Slave_TIMER
                                    SHRTIMER_ST_UPDATE_SELECTION_STXUPINy_UPDATE(y=2), for Slave_TIMER
                  cnt_bunch: SHRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK, SHRTIMER_TIMERBUNCHMODE_RESETCOUNTER
                  repetition_update: SHRTIMER_UPDATEONREPETITION_DISABLED, SHRTIMER_UPDATEONREPETITION_ENABLED
    \param[out] none
    \retval     none
*/
void shrtimer_timers_waveform_init(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_timerinit_parameter_struct* timerinitpara)
{
    if(SHRTIMER_MASTER_TIMER == timer_id)
    {
        /* configure Master_TIMER in waveform mode */
        master_timer_waveform_config(shrtimer_periph, timerinitpara);
    }else{
        /* configure Slave_TIMER in waveform mode */
        slave_timer_waveform_config(shrtimer_periph, timer_id, timerinitpara);
    }
}

/*!
    \brief      initialize Slave_TIMER general behavior configuration struct with a default value
    \param[in]  timercfg: Slave_TIMER general behavior configuration struct
    \param[out] none
    \retval     none
*/
void shrtimer_timercfg_struct_para_init(shrtimer_timercfg_parameter_struct* timercgf)
{
    timercgf->balanced_mode = SHRTIMER_STXBALANCEDMODE_DISABLED;
    timercgf->cnt_reset = SHRTIMER_STXCNT_RESET_NONE;
    timercgf->deadtime_enable = SHRTIMER_STXDEADTIME_DISABLED;
    timercgf->delayed_idle = SHRTIMER_STXDELAYED_IDLE_DISABLED;
    timercgf->fault_enable = SHRTIMER_STXFAULTENABLE_NONE;
    timercgf->fault_protect = SHRTIMER_STXFAULT_PROTECT_READWRITE;
    timercgf->reset_update = SHRTIMER_STXUPDATEONRESET_DISABLED;
    timercgf->update_source = SHRTIMER_STXUPDATETRIGGER_NONE;
}

/*!
    \brief      configure the general behavior of a Slave_TIMER which work in waveform mode 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  timercfg: Slave_TIMER general behavior configuration struct
                  balanced_mode: SHRTIMER_STXBALANCEDMODE_DISABLED, SHRTIMER_STXBALANCEDMODE_ENABLED
                  fault_enable: SHRTIMER_STXFAULTENABLE_NONE, SHRTIMER_STXFAULTENABLE_FAULT0, SHRTIMER_STXFAULTENABLE_FAULT1, SHRTIMER_STXFAULTENABLE_FAULT2, SHRTIMER_STXFAULTENABLE_FAULT3 ,SHRTIMER_STXFAULTENABLE_FAULT4
                  fault_protect: SHRTIMER_STXFAULT_PROTECT_READWRITE, SHRTIMER_STXFAULT_PROTECT_READONLY
                  deadtime_enable: SHRTIMER_STXDEADTIME_DISABLED, SHRTIMER_STXDEADTIME_ENABLED
                  delayed_idle: SHRTIMER_STXDELAYED_IDLE_DISABLED,SHRTIMER_STXDELAYED_IDLE_CH0_EEV57,SHRTIMER_STXDELAYED_IDLE_CH1_EEV57,SHRTIMER_STXDELAYED_IDLE_BOTH_EEV57,SHRTIMER_STXDELAYED_IDLE_BALANCED_EEV57,
                                 SHRTIMER_STXDELAYED_IDLE_CH0_DEEV68,SHRTIMER_STXDELAYED_IDLE_CH1_DEEV68,SHRTIMER_STXDELAYED_IDLE_BOTH_EEV68,SHRTIMER_STXDELAYED_IDLE_BALANCED_EEV68
                  update_source: SHRTIMER_STXUPDATETRIGGER_NONE, SHRTIMER_STXUPDATETRIGGER_MASTER, SHRTIMER_STXUPDATETRIGGER_STx(x=0..4)
                  cnt_reset: SHRTIMER_STXCNT_RESET_NONE, SHRTIMER_STXCNT_RESET_UPDATE, SHRTIMER_STXCNT_RESET_CMP1, SHRTIMER_STXCNT_RESET_CMP3, SHRTIMER_STXCNT_RESET_MASTER_PER, SHRTIMER_STXCNT_RESET_MASTER_CMPy(y=0..3),
                             SHRTIMER_STXCNT_RESET_EEV_y(y=0..9), SHRTIMER_STXCNT_RESET_OTHERx_CMPy(x=0..3, y=0,1,3)
                  reset_update: SHRTIMER_STXUPDATEONRESET_DISABLED, SHRTIMER_STXUPDATEONRESET_ENABLED
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_waveform_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_timercfg_parameter_struct * timercfg)
{
    uint32_t stxctl0_reg;
    uint32_t stxfltctl_reg;
    uint32_t stxchoctl_reg;
    uint32_t stxcntrst_reg;

