GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_shrtimer.c
    switch (channel)
    {
        /* get Slave_TIMER channel 0 output level */
        case SHRTIMER_ST0_CH0:
        case SHRTIMER_ST1_CH0:
        case SHRTIMER_ST2_CH0:
        case SHRTIMER_ST3_CH0:
        case SHRTIMER_ST4_CH0:
        {
            if(RESET != (SHRTIMER_STXINTF(shrtimer_periph, timer_id) & SHRTIMER_STXINTF_CH0F)){
                output_level = SHRTIMER_CHANNEL_OUTPUT_ACTIVE;
            }else{
                output_level = SHRTIMER_CHANNEL_OUTPUT_INACTIVE;
            }
        }
        break;
        /* get Slave_TIMER channel 1 output level */
        case SHRTIMER_ST0_CH1:
        case SHRTIMER_ST1_CH1:
        case SHRTIMER_ST2_CH1:
        case SHRTIMER_ST3_CH1:
        case SHRTIMER_ST4_CH1:
        {
            if(RESET != (SHRTIMER_STXINTF(shrtimer_periph, timer_id) & SHRTIMER_STXINTF_CH1F)){
                output_level = SHRTIMER_CHANNEL_OUTPUT_ACTIVE;
            }else{
                output_level = SHRTIMER_CHANNEL_OUTPUT_INACTIVE;
            }
        }
        break;
        default:
        break;
    }
    return output_level;
}

/*!
    \brief      get Slave_TIMER channel run state
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  channel: SHRTIMER_STx_CHy(x=0..4,y=0,1)
    \param[out] none
    \retval     channel state
*/
uint32_t shrtimer_slavetimer_waveform_channel_state_get(uint32_t shrtimer_periph, uint32_t channel)
{
    uint32_t enbit = 0U;
    uint32_t state = SHRTIMER_CHANNEL_STATE_IDLE;
    
    switch (channel)
    {
        /* get Slave_TIMER0 channel 0 run state */
        case SHRTIMER_ST0_CH0:
            enbit = SHRTIMER_CHOUTEN_ST0CH0EN;
        break;
        /* get Slave_TIMER0 channel 1 run state */
        case SHRTIMER_ST0_CH1:
            enbit = SHRTIMER_CHOUTEN_ST0CH1EN;
        break;
        /* get Slave_TIMER1 channel 0 run state */
        case SHRTIMER_ST1_CH0:
            enbit = SHRTIMER_CHOUTEN_ST1CH0EN;
        break;
        /* get Slave_TIMER1 channel 1 run state */
        case SHRTIMER_ST1_CH1:
            enbit = SHRTIMER_CHOUTEN_ST1CH1EN;
        break;
        /* get Slave_TIMER2 channel 0 run state */
        case SHRTIMER_ST2_CH0:
            enbit = SHRTIMER_CHOUTEN_ST2CH0EN;
        break;
        /* get Slave_TIMER2 channel 1 run state */
        case SHRTIMER_ST2_CH1:
            enbit = SHRTIMER_CHOUTEN_ST2CH1EN;
        break;
        /* get Slave_TIMER3 channel 0 run state */
        case SHRTIMER_ST3_CH0:
            enbit = SHRTIMER_CHOUTEN_ST3CH0EN;
        break;
        /* get Slave_TIMER3 channel 1 run state */
        case SHRTIMER_ST3_CH1:
            enbit = SHRTIMER_CHOUTEN_ST3CH1EN;
        break;
        /* get Slave_TIMER4 channel 0 run state */
        case SHRTIMER_ST4_CH0:
            enbit = SHRTIMER_CHOUTEN_ST4CH0EN;
        break;
        /* get Slave_TIMER4 channel 1 run state */
        case SHRTIMER_ST4_CH1:
            enbit = SHRTIMER_CHOUTEN_ST4CH1EN;
        break;
        default:
        break;
    }
    if ( RESET != (SHRTIMER_CHOUTEN(shrtimer_periph) & enbit)){
        /* Run state*/
        state = SHRTIMER_CHANNEL_STATE_RUN;
    }else{
        if (RESET != (SHRTIMER_CHOUTDISF(shrtimer_periph) & enbit)){
            /* Fault state */ 
            state = SHRTIMER_CHANNEL_STATE_FAULT;
        }else{
            /* Idle state */
            state = SHRTIMER_CHANNEL_STATE_IDLE;
        }
    }
    return state;
}

/*!
    \brief      initialize dead time configuration struct with a default value
    \param[in]  dtcfg: dead time configuration struct
    \param[out] none
    \retval     none
*/
void shrtimer_deadtimercfg_struct_para_init(shrtimer_deadtimecfg_parameter_struct * dtcfg)
{
    dtcfg->fallingsign_protect = SHRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE;
    dtcfg->falling_protect = SHRTIMER_DEADTIME_FALLING_PROTECT_DISABLE;
    dtcfg->falling_sign = SHRTIMER_DEADTIME_FALLINGSIGN_POSITIVE;
    dtcfg->falling_value = 0U;
    dtcfg->prescaler = SHRTIMER_DEADTIME_PRESCALER_MUL8;
    dtcfg->risingsign_protect = SHRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE;
    dtcfg->rising_protect = SHRTIMER_DEADTIME_RISING_PROTECT_DISABLE;
    dtcfg->rising_sign = SHRTIMER_DEADTIME_RISINGSIGN_POSITIVE;
    dtcfg->rising_value = 0U;
}

/*!
    \brief      configure the dead time for Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  dtcfg: dead time configuration struct
                  prescaler: SHRTIMER_DEADTIME_PRESCALER_MULy(y=64,32,16,8,4,2), SHRTIMER_DEADTIME_PRESCALER_DIVy(y=1,2,4,8,16)
                  rising_value: 0x0000~0xFFFF
                  rising_sign: SHRTIMER_DEADTIME_RISINGSIGN_POSITIVE, SHRTIMER_DEADTIME_RISINGSIGN_NEGATIVE
                  rising_protect: SHRTIMER_DEADTIME_RISING_PROTECT_DISABLE, SHRTIMER_DEADTIME_RISING_PROTECT_ENABLE
                  risingsign_protect: SHRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE, SHRTIMER_DEADTIME_RISINGSIGN_PROTECT_ENABLE
                  falling_value: 0x0000~0xFFFF
                  falling_sign: SHRTIMER_DEADTIME_FALLINGSIGN_POSITIVE, SHRTIMER_DEADTIME_FALLINGSIGN_NEGATIVE
                  falling_protect: SHRTIMER_DEADTIME_FALLING_PROTECT_DISABLE, SHRTIMER_DEADTIME_FALLING_PROTECT_ENABLE
                  fallingsign_protect: SHRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE, SHRTIMER_DEADTIME_FALLINGSIGN_PROTECT_ENABLE
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_deadtime_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_deadtimecfg_parameter_struct* dtcfg)
{
    uint32_t dtctl_reg;
    uint32_t stxactl;

    dtctl_reg = SHRTIMER_STXDTCTL(shrtimer_periph, timer_id);
    stxactl = SHRTIMER_STXACTL(shrtimer_periph, timer_id);
     
    /* clear dead time configuration */
    dtctl_reg &= ~(SHRTIMER_STXDTCTL_DTRCFG8_0 | SHRTIMER_STXDTCTL_DTRS | SHRTIMER_STXDTCTL_DTGCKDIV |
                 SHRTIMER_STXDTCTL_DTRSPROT | SHRTIMER_STXDTCTL_DTRSVPROT | SHRTIMER_STXDTCTL_DTFCFG8_0 |
                 SHRTIMER_STXDTCTL_DTFS | SHRTIMER_STXDTCTL_DTFSPROT | SHRTIMER_STXDTCTL_DTFSVPROT);
    stxactl &= ~(SHRTIMER_STXACTL_DTRCFG15_9 | SHRTIMER_STXACTL_DTFCFG15_9);
  
    /* set dead time configuration */
    dtctl_reg |= (dtcfg->prescaler << 10);
    dtctl_reg |= ((dtcfg->rising_value) & SHRTIMER_STXDTCTL_DTRCFG8_0);
    stxactl |= (((dtcfg->rising_value) & (~SHRTIMER_STXDTCTL_DTRCFG8_0)));
    dtctl_reg |= dtcfg->rising_sign;
    dtctl_reg |= dtcfg->risingsign_protect;
    dtctl_reg |= dtcfg->rising_protect;
    dtctl_reg |= (((dtcfg->falling_value) & SHRTIMER_STXDTCTL_DTRCFG8_0) << 16);
    stxactl |= ((dtcfg->falling_value) & (~SHRTIMER_STXDTCTL_DTRCFG8_0)) << 16;
    dtctl_reg |= dtcfg->falling_sign;
    dtctl_reg |= dtcfg->fallingsign_protect;
    dtctl_reg |= dtcfg->falling_protect;
    
    SHRTIMER_STXACTL(shrtimer_periph, timer_id) = stxactl;
    SHRTIMER_STXDTCTL(shrtimer_periph, timer_id) = dtctl_reg;
}

/*!
    \brief      initialize carrier signal configuration struct with a default value
    \param[in]  carriercfg: carrier signal configuration struct
    \param[out] none
    \retval     none
*/
void shrtimer_carriersignalcfg_struct_para_init(shrtimer_carriersignalcfg_parameter_struct* carriercfg)
{
    carriercfg->duty_cycle = 0U;
    carriercfg->first_pulse = 0U;
    carriercfg->period = 0U;
}

/*!
    \brief      configure the carrier signal mode for Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  carriercfg: carrier signal configuration struct
                  period: 0x0~0xF. specifies carrier signal period: (period + 1) * 16 * tSHRTIMER_CK
                  duty_cycle: 0x0~0x7. specifies Carrier signal duty cycle: duty_cycle/8
                  first_pulse: 0x0~0xF. specifies first carrier-signal pulse width: (first_pulse+1) * 16 * tSHRTIMER_CK
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_carriersignal_config(uint32_t shrtimer_periph, uint32_t timer_id, shrtimer_carriersignalcfg_parameter_struct* carriercfg)
{
    uint32_t csctl_reg;
  
    csctl_reg = SHRTIMER_STXCSCTL(shrtimer_periph, timer_id);
     
    /* clear timer chopper mode configuration */
    csctl_reg &= ~(SHRTIMER_STXCSCTL_CSPRD | SHRTIMER_STXCSCTL_CSDTY | SHRTIMER_STXCSCTL_CSFSTPW);
  
    /* set timer chopper mode configuration */
    csctl_reg |= carriercfg->period;
    csctl_reg |= (carriercfg->duty_cycle << 4);
    csctl_reg |= (carriercfg->first_pulse << 7);
    
    SHRTIMER_STXCSCTL(shrtimer_periph, timer_id) = csctl_reg;
}

/*!
    \brief      enable a output channel
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  chid: specify the channel to configure
                only one can be selected which is shown as below:
      \arg          SHRTIMER_ST0_CH0: ST0CH0_O output channel
      \arg          SHRTIMER_ST0_CH1: ST0CH1_O output channel
      \arg          SHRTIMER_ST1_CH0: ST1CH0_O output channel
      \arg          SHRTIMER_ST1_CH1: ST1CH1_O output channel
      \arg          SHRTIMER_ST2_CH0: ST2CH0_O output channel
      \arg          SHRTIMER_ST2_CH1: ST2CH1_O output channel
      \arg          SHRTIMER_ST3_CH0: ST3CH0_O output channel
      \arg          SHRTIMER_ST3_CH1: ST3CH1_O output channel
      \arg          SHRTIMER_ST4_CH0: ST4CH0_O output channel
      \arg          SHRTIMER_ST4_CH1: ST4CH1_O output channel
    \param[out] none
    \retval     none
*/
void shrtimer_output_channel_enable(uint32_t shrtimer_periph, uint32_t chid)
{
    SHRTIMER_CHOUTEN(shrtimer_periph) = chid;
}

/*!
    \brief      disable a output channel
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  chid: specify the channel to configure
                only one can be selected which is shown as below:
      \arg          SHRTIMER_ST0_CH0: ST0CH0_O output channel
      \arg          SHRTIMER_ST0_CH1: ST0CH1_O output channel
      \arg          SHRTIMER_ST1_CH0: ST1CH0_O output channel
      \arg          SHRTIMER_ST1_CH1: ST1CH1_O output channel
      \arg          SHRTIMER_ST2_CH0: ST2CH0_O output channel
      \arg          SHRTIMER_ST2_CH1: ST2CH1_O output channel
      \arg          SHRTIMER_ST3_CH0: ST3CH0_O output channel
      \arg          SHRTIMER_ST3_CH1: ST3CH1_O output channel
      \arg          SHRTIMER_ST4_CH0: ST4CH0_O output channel
      \arg          SHRTIMER_ST4_CH1: ST4CH1_O output channel
    \param[out] none
    \retval     none
*/
void shrtimer_output_channel_disable(uint32_t shrtimer_periph, uint32_t chid)
{
    SHRTIMER_CHOUTDIS(shrtimer_periph) = chid;
}

/*!
    \brief      configure the compare value in Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  comparex: SHRTIMER_COMPAREy(y=0..3), SHRTIMER_COMPARE0_COMPOSITE
    \param[in]  cmpvalue:  min value: 3 tSHRTIMER_CK clock, max value: 0xFFFF - (1 tSHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_compare_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t comparex, uint32_t cmpvalue)
{
    /* configure the compare unit */
    switch (comparex)
    {
        case SHRTIMER_COMPARE0:
        {
            /* set the compare 0 value */
            SHRTIMER_STXCMP0V(shrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE1:
        {
            /* set the compare 1 value */
            SHRTIMER_STXCMP1V(shrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE2:
        {
            /* set the compare 2 value */
            SHRTIMER_STXCMP2V(shrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE3:
        {
            /* set the compare 3 value */
            SHRTIMER_STXCMP3V(shrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE0_COMPOSITE:
        {
            /* set the compare 0 composite value */
            SHRTIMER_STXCMP0CP(shrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the compare value in Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  comparex: SHRTIMER_COMPAREy(y=0..3), SHRTIMER_COMPARE0_COMPOSITE
    \param[out] none
    \retval     the compare value
*/
uint32_t shrtimer_slavetimer_compare_value_get(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t comparex)
{
    uint32_t cmpval = 0U;
    /* configure the compare unit */
    switch (comparex)
    {
        case SHRTIMER_COMPARE0:
        {
            /* get the compare 0 value */
            cmpval = SHRTIMER_STXCMP0V(shrtimer_periph, timer_id);
        }
        break;
        case SHRTIMER_COMPARE1:
        {
            /* get the compare 1 value */
            cmpval = SHRTIMER_STXCMP1V(shrtimer_periph, timer_id);
        }
        break;
        case SHRTIMER_COMPARE2:
        {
            /* get the compare 2 value */
            cmpval = SHRTIMER_STXCMP2V(shrtimer_periph, timer_id);
        }
        break;
        case SHRTIMER_COMPARE3:
        {
            /* get the compare 3 value */
            cmpval = SHRTIMER_STXCMP3V(shrtimer_periph, timer_id);
        }
        break;
        case SHRTIMER_COMPARE0_COMPOSITE:
        {
            /* get the compare 0 composite value */
            cmpval = SHRTIMER_STXCMP0CP(shrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }  
    return cmpval;
}

/*!
    \brief      configure the compare value in Master_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  comparex: SHRTIMER_COMPAREy(y=0..3)
    \param[in]  cmpvalue: min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF - (1*tSHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void shrtimer_mastertimer_compare_value_config(uint32_t shrtimer_periph, uint32_t comparex, uint32_t cmpvalue)
{
    /* configure the compare unit */
    switch (comparex)
    {
        case SHRTIMER_COMPARE0:
        {
            /* set the compare 0 value */
            SHRTIMER_MTCMP0V(shrtimer_periph) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE1:
        {
            /* set the compare 1 value */
            SHRTIMER_MTCMP1V(shrtimer_periph) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE2:
        {
            /* set the compare 2 value */
            SHRTIMER_MTCMP2V(shrtimer_periph) = cmpvalue;
        }
        break;
        case SHRTIMER_COMPARE3:
        {
            /* set the compare 3 value */
            SHRTIMER_MTCMP3V(shrtimer_periph) = cmpvalue;
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the compare value in Master_TIMER  
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  comparex: SHRTIMER_COMPAREy(y=0..3)
    \param[out] none
    \retval     the compare value
*/
uint32_t shrtimer_mastertimer_compare_value_get(uint32_t shrtimer_periph, uint32_t comparex)
{
    uint32_t cmpval = 0U;
    switch (comparex)
    {
        case SHRTIMER_COMPARE0:
        {
            /* get the compare 0 value */
            cmpval = SHRTIMER_MTCMP0V(shrtimer_periph);
        }
        break;
        case SHRTIMER_COMPARE1:
        {
            /* get the compare 1 value */
            cmpval = SHRTIMER_MTCMP1V(shrtimer_periph);
        }
        break;
        case SHRTIMER_COMPARE2:
        {
            /* get the compare 2 value */
            cmpval = SHRTIMER_MTCMP2V(shrtimer_periph);
        }
        break;
        case SHRTIMER_COMPARE3:
        {
            /* get the compare 3 value */
            cmpval = SHRTIMER_MTCMP3V(shrtimer_periph);
        }
        break;
        default:
        break;
    }  
    return cmpval;
}

/*!
    \brief      configure the counter value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  cntvalue: min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF - (1*tSHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void shrtimer_timers_counter_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t cntvalue)
{
    /* configure the counter */
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_MTCEN)){
                /* set the Master_TIMER counter value */
                SHRTIMER_MTCNT(shrtimer_periph) = cntvalue;
            }
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_ST0CEN)){
                /* set the Slave_TIMER0 compare value */
                SHRTIMER_STXCNT(shrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case SHRTIMER_SLAVE_TIMER1:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_ST1CEN)){
                /* set the Slave_TIMER1 compare value */
                SHRTIMER_STXCNT(shrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case SHRTIMER_SLAVE_TIMER2:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_ST2CEN)){
                /* set the Slave_TIMER2 compare value */
                SHRTIMER_STXCNT(shrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case SHRTIMER_SLAVE_TIMER3:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_ST3CEN)){
                /* set the Slave_TIMER3 compare value */
                SHRTIMER_STXCNT(shrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case SHRTIMER_SLAVE_TIMER4:
        {
            if(RESET == (SHRTIMER_MTCTL0(shrtimer_periph) & SHRTIMER_MTCTL0_ST4CEN)){
                /* set the Slave_TIMER4 counter value */
                SHRTIMER_STXCNT(shrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the counter value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[out] none
    \retval     the counter value
*/
uint32_t shrtimer_timers_counter_value_get(uint32_t shrtimer_periph, uint32_t timer_id)
{
    uint32_t cunval = 0U;
    
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter value */
            cunval = SHRTIMER_MTCNT(shrtimer_periph);
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
        {
            /* get the Slave_TIMER counter value */
            cunval = SHRTIMER_STXCNT(shrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return cunval;
}

/*!
    \brief      configure the counter auto reload value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  carlvalue: min value: 3*tSHRTIMER_CK clock, max value: 0xFFFF - (1*tSHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void shrtimer_timers_autoreload_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t carlvalue)
{
    /* configure the counter auto reload value */
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            /* set the Master_TIMER counter value */
            SHRTIMER_MTCAR(shrtimer_periph) = carlvalue;
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
        {
            /* set the Slave_TIMER compare value */
            SHRTIMER_STXCAR(shrtimer_periph, timer_id) = carlvalue;
        }
        break;
        default:
        break;
    }
}
/*!
    \brief      get the counter auto reload value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[out] none
    \retval     the counter auto reload value
*/
uint32_t shrtimer_timers_autoreload_value_get(uint32_t shrtimer_periph, uint32_t timer_id)
{
    uint32_t cralval = 0U;
    
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter auto reload value value */
            cralval = SHRTIMER_MTCAR(shrtimer_periph);
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
        {
            /* get the Slave_TIMER counter auto reload value value */
            cralval = SHRTIMER_STXCAR(shrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return cralval;
}

/*!
    \brief      configure the counter repetition value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  replvalue: 0~255
    \param[out] none
    \retval     none
*/
void shrtimer_timers_repetition_value_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t replvalue)
{
    /* configure the counter repetition value */
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            /* set the Master_TIMER repetition value */
            SHRTIMER_MTCREP(shrtimer_periph) = replvalue;
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
        {
            /* set the Slave_TIMER repetition value */
            SHRTIMER_STXCREP(shrtimer_periph, timer_id) = replvalue;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      get the counter repetition value in Master_TIMER and Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_MASTER_TIMER, SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[out] none
    \retval     the counter repetition value
*/
uint32_t shrtimer_timers_repetition_value_get(uint32_t shrtimer_periph, uint32_t timer_id)
{
    uint32_t repval = 0U;
    
    switch (timer_id)
    {
        case SHRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter repetition value value */
            repval = SHRTIMER_MTCREP(shrtimer_periph);
        }
        break;
        case SHRTIMER_SLAVE_TIMER0:
        case SHRTIMER_SLAVE_TIMER1:
        case SHRTIMER_SLAVE_TIMER2:
        case SHRTIMER_SLAVE_TIMER3:
        case SHRTIMER_SLAVE_TIMER4:
        {
            /* get the Slave_TIMER counter repetition value value */
            repval = SHRTIMER_STXCREP(shrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return repval;
}

/*!
    \brief      initialize external event filtering for Slave_TIMER configuration struct with a default value
    \param[in]  exevfilter: external event filtering for Slave_TIMER struct definitions
    \param[out] none
    \retval     none
*/
void shrtimer_exevfilter_struct_para_init(shrtimer_exevfilter_parameter_struct * exevfilter)
{
    exevfilter->filter_mode = SHRTIMER_EXEVFILTER_DISABLE;
    exevfilter->memorized = SHRTIMER_EXEVMEMORIZED_DISABLE;
}

