GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_shrtimer.c
    mtctl0_reg = SHRTIMER_MTCTL0(shrtimer_periph);

    /* set the synchronization input source */
    mtctl0_reg &= ~(SHRTIMER_MTCTL0_SYNISRC);
    mtctl0_reg |= synccfg->input_source;
  
    /* set the event to be sent on the synchronization output */
    mtctl0_reg &= ~(SHRTIMER_MTCTL0_SYNOSRC);
    mtctl0_reg |= synccfg->output_source;
  
    /* set the polarity of the synchronization output */
    mtctl0_reg &= ~(SHRTIMER_MTCTL0_SYNOPLS);
    mtctl0_reg |= synccfg->output_polarity;
  
    SHRTIMER_MTCTL0(shrtimer_periph) = mtctl0_reg;
}

/*!
    \brief      initialize fault input configuration struct with a default value
    \param[in]  faultcfg: fault input configuration struct
    \param[out] none
    \retval     none
*/
void shrtimer_faultcfg_struct_para_init(shrtimer_faultcfg_parameter_struct * faultcfg)
{
    faultcfg->filter = 0x0U;
    faultcfg->polarity = SHRTIMER_FAULT_POLARITY_LOW;
    faultcfg->protect = SHRTIMER_FAULT_PROTECT_DISABLE;
    faultcfg->source = SHRTIMER_FAULT_SOURCE_PIN;
    faultcfg->control = SHRTIMER_FAULT_CHANNEL_DISABLE;
}

/*!
    \brief      configure the fault input
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  fault_id: SHRTIMER_FAULT_y(y=0..4)
    \param[in]  faultcfg: fault input configuration struct
                  source: SHRTIMER_FAULT_SOURCE_PIN, SHRTIMER_FAULT_SOURCE_INTERNAL
                  polarity: SHRTIMER_FAULT_POLARITY_LOW, SHRTIMER_FAULT_POLARITY_HIGH
                  control: SHRTIMER_FAULT_CHANNEL_DISABLE, SHRTIMER_FAULT_CHANNEL_ENABLE
                  filter: 0x0~0xF
                  protect: SHRTIMER_FAULT_PROTECT_DISABLE, SHRTIMER_FAULT_PROTECT_ENABLE
    \param[out] none
    \retval     none
*/
void shrtimer_fault_config(uint32_t shrtimer_periph, uint32_t fault_id, shrtimer_faultcfg_parameter_struct* faultcfg)
{
    uint32_t fltincfg0;
    uint32_t fltincfg1;

    fltincfg0 = SHRTIMER_FLTINCFG0(shrtimer_periph);
    fltincfg1 = SHRTIMER_FLTINCFG1(shrtimer_periph);
  
    switch (fault_id)
    {
        case SHRTIMER_FAULT_0:
        {
            /* configure fault input 0 */
            fltincfg0 &= ~( SHRTIMER_FLTINCFG0_FLT0INP | SHRTIMER_FLTINCFG0_FLT0INSRC | SHRTIMER_FLTINCFG0_FLT0INFC | SHRTIMER_FLTINCFG0_FLT0INPROT | SHRTIMER_FLTINCFG0_FLT0INEN);
            fltincfg0 |= faultcfg->source;
            fltincfg0 |= faultcfg->polarity;
            fltincfg0 |= ((faultcfg->filter) << 3);
            fltincfg0 |= faultcfg->control;
            fltincfg0 |= faultcfg->protect;
        }
        break;
        case SHRTIMER_FAULT_1:
        {
            /* configure fault input 1 */
            fltincfg0 &= ~( SHRTIMER_FLTINCFG0_FLT1INP | SHRTIMER_FLTINCFG0_FLT1INSRC | SHRTIMER_FLTINCFG0_FLT1INFC | SHRTIMER_FLTINCFG0_FLT1INPROT | SHRTIMER_FLTINCFG0_FLT1INEN );
            fltincfg0 |= ((faultcfg->source) << 8);
            fltincfg0 |= ((faultcfg->polarity) << 8);
            fltincfg0 |= ((faultcfg->filter) << 11);
            fltincfg0 |= ((faultcfg->control) << 8);
            fltincfg0 |= ((faultcfg->protect) << 8);
        }
        break;
        case SHRTIMER_FAULT_2:
        {
            /* configure fault input 2 */
            fltincfg0 &= ~( SHRTIMER_FLTINCFG0_FLT2INP | SHRTIMER_FLTINCFG0_FLT2INSRC | SHRTIMER_FLTINCFG0_FLT2INFC | SHRTIMER_FLTINCFG0_FLT2INPROT | SHRTIMER_FLTINCFG0_FLT2INEN);
            fltincfg0 |= ((faultcfg->source) << 16);
            fltincfg0 |= ((faultcfg->polarity) << 16);
            fltincfg0 |= ((faultcfg->filter) << 19);
            fltincfg0 |= ((faultcfg->control) << 16);
            fltincfg0 |= ((faultcfg->protect) << 16);
        }
        break;
        case SHRTIMER_FAULT_3:
        {
            /* configure fault input 3 */
            fltincfg0 &= ~( SHRTIMER_FLTINCFG0_FLT3INP | SHRTIMER_FLTINCFG0_FLT3INSRC | SHRTIMER_FLTINCFG0_FLT3INFC | SHRTIMER_FLTINCFG0_FLT3INPROT | SHRTIMER_FLTINCFG0_FLT3INEN);
            fltincfg0 |= ((faultcfg->source) << 24);
            fltincfg0 |= ((faultcfg->polarity) << 24);
            fltincfg0 |= ((faultcfg->filter) << 27);
            fltincfg0 |= ((faultcfg->control) << 24);
            fltincfg0 |= ((faultcfg->protect) << 24);
        }
        break;
        case SHRTIMER_FAULT_4:
        {
            /* configure fault input 4 */
            fltincfg1 &= ~( SHRTIMER_FLTINCFG1_FLT4INP | SHRTIMER_FLTINCFG1_FLT4INSRC | SHRTIMER_FLTINCFG1_FLT4INFC | SHRTIMER_FLTINCFG1_FLT4INPROT | SHRTIMER_FLTINCFG1_FLT4INEN);
            fltincfg1 |= faultcfg->source;
            fltincfg1 |= faultcfg->polarity;
            fltincfg1 |= ((faultcfg->filter) << 3);
            fltincfg1 |= (faultcfg->control);
            fltincfg1 |= faultcfg->protect;
        }
        break;
        default:
        break;
    }

    SHRTIMER_FLTINCFG0(shrtimer_periph) = fltincfg0;
    SHRTIMER_FLTINCFG1(shrtimer_periph) = fltincfg1;
}

/*!
    \brief      configure the fault input digital filter clock division
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  prescaler: clock division value
                only one parameter can be selected which is shown as below:
      \arg          SHRTIMER_FAULT_PRESCALER_DIV1: fSHRTIMER_FLTFCK = fSHRTIMER_CK 
      \arg          SHRTIMER_FAULT_PRESCALER_DIV2: fSHRTIMER_FLTFCK = fSHRTIMER_CK / 2 
      \arg          SHRTIMER_EFAULT_PRESCALER_DIV4: fSHRTIMER_FLTFCK = fSHRTIMER_CK / 4 
      \arg          SHRTIMER_FAULT_PRESCALER_DIV8: fSHRTIMER_FLTFCK = fSHRTIMER_CK / 8 
    \param[out] none
    \retval     none
*/
void shrtimer_fault_prescaler_config(uint32_t shrtimer_periph, uint32_t prescaler)
{
    uint32_t fltincfg1;

    /* configure digital filter clock division */
    fltincfg1 = SHRTIMER_FLTINCFG1(shrtimer_periph);
    fltincfg1 &= ~(SHRTIMER_FLTINCFG1_FLTFDIV);
    fltincfg1 |= prescaler;
    SHRTIMER_FLTINCFG1(shrtimer_periph) = fltincfg1;
}

/*!
    \brief      fault input enable
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  fault_id: SHRTIMER_FAULT_y(y=0..4)
    \param[out] none
    \retval     none
*/
void shrtimer_fault_input_enable(uint32_t shrtimer_periph, uint32_t fault_id)
{
    uint32_t fltincfg0;
    uint32_t fltincfg1;

