GigaDevice-GD32-MCU/GD32A508_Firmware_Library/Firmware/GD32A508_standard_peripheral/Source/gd32a508_shrtimer.c
    /* set the bunch mode trigger */
    SHRTIMER_BMSTRG(shrtimer_periph) = bmcfg->trigger;
  
    /* set the bunch mode compare value */
    SHRTIMER_BMCMPV(shrtimer_periph) = bmcfg->idle_duration;
    
    /* set the bunch mode period */
    SHRTIMER_BMCAR(shrtimer_periph) = bmcfg->period;
   
    SHRTIMER_BMCTL(shrtimer_periph) = bmctl_reg;
}

/*!
    \brief      enable bunch mode for the SHRTIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[out] none
    \retval     none
*/
void shrtimer_bunchmode_enable(uint32_t shrtimer_periph)
{
    SHRTIMER_BMCTL(shrtimer_periph) |= SHRTIMER_BMCTL_BMEN;
}

/*!
    \brief      disable bunch mode for the SHRTIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[out] none
    \retval     none
*/
void shrtimer_bunchmode_disable(uint32_t shrtimer_periph)
{
    SHRTIMER_BMCTL(shrtimer_periph) &= ~SHRTIMER_BMCTL_BMEN;
}

/*!
    \brief      get bunch mode operating flag
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[out] none
    \retval     bunch mode operating state
*/
uint32_t shrtimer_bunchmode_flag_get(uint32_t shrtimer_periph)
{
    uint32_t val = SHRTIMER_BUNCHMODE_OPERATION_OFF;
    /* judge bunch mode operating state */
    if(RESET != (SHRTIMER_BMCTL(shrtimer_periph) & SHRTIMER_BMCTL_BMOPTF)){
        val = SHRTIMER_BUNCHMODE_OPERATION_ON;
    }else{
        val = SHRTIMER_BUNCHMODE_OPERATION_OFF;
    }
    return val;
}

/*!
    \brief      bunch mode started by software
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[out] none
    \retval     bunch mode operating state
*/
void shrtimer_bunchmode_software_start(uint32_t shrtimer_periph)
{
    SHRTIMER_BMSTRG(shrtimer_periph) |= SHRTIMER_BMSTRG_SWTRG;
}

/*!
    \brief      configure the capture source in Slave_TIMER
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  capturex: SHRTIMER_CAPTURE_y(y=0, 1)
    \param[in]  trgsource: capture source
                one or more parameters can be selected which is shown as below:
      \arg         SHRTIMER_CAPTURETRIGGER_NONE: Capture trigger is disabled
      \arg         SHRTIMER_CAPTURETRIGGER_UPDATE: capture triggered by update event
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_0: capture triggered by external event 0
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_1: capture triggered by external event 1
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_2: capture triggered by external event 2
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_3: capture triggered by external event 3
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_4: capture triggered by external event 4
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_5: capture triggered by external event 5
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_6: capture triggered by external event 6
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_7: capture triggered by external event 7
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_8: capture triggered by external event 8
      \arg         SHRTIMER_CAPTURETRIGGER_EXEV_9: capture triggered by external event 9
      \arg         SHRTIMER_CAPTURETRIGGER_ST0_ACTIVE: capture triggered by ST0CH0_O output inactive to active transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST0_INACTIVE: capture triggered by ST0CH0_O output active to inactive transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST0_CMP0: capture triggered by compare 0 event of Slave_TIMER0     
      \arg         SHRTIMER_CAPTURETRIGGER_ST0_CMP1: capture triggered by compare 1 event of Slave_TIMER0     
      \arg         SHRTIMER_CAPTURETRIGGER_ST1_ACTIVE: capture triggered by ST1CH0_O output inactive to active transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST1_INACTIVE: capture triggered by ST1CH0_O output active to inactive transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST1_CMP0: capture triggered by compare 0 event of Slave_TIMER1     
      \arg         SHRTIMER_CAPTURETRIGGER_ST1_CMP1: capture triggered by compare 1 event of Slave_TIMER1     
      \arg         SHRTIMER_CAPTURETRIGGER_ST2_ACTIVE: capture triggered by ST2CH0_O output inactive to active transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST2_INACTIVE: capture triggered by ST2CH0_O output active to inactive transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST2_CMP0: capture triggered by compare 0 event of Slave_TIMER2     
      \arg         SHRTIMER_CAPTURETRIGGER_ST2_CMP1: capture triggered by compare 1 event of Slave_TIMER2     
      \arg         SHRTIMER_CAPTURETRIGGER_ST3_ACTIVE: capture triggered by ST3CH0_O output inactive to active transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST3_INACTIVE: capture triggered by ST3CH0_O output active to inactive transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST3_CMP0: capture triggered by compare 0 event of Slave_TIMER3     
      \arg         SHRTIMER_CAPTURETRIGGER_ST3_CMP1: capture triggered by compare 1 event of Slave_TIMER3     
      \arg         SHRTIMER_CAPTURETRIGGER_ST4_ACTIVE: capture triggered by ST4CH0_O output inactive to active transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST4_INACTIVE: capture triggered by ST4CH0_O output active to inactive transition     
      \arg         SHRTIMER_CAPTURETRIGGER_ST4_CMP0: capture triggered by compare 0 event of Slave_TIMER4     
      \arg         SHRTIMER_CAPTURETRIGGER_ST4_CMP1: capture triggered by compare 1 event of Slave_TIMER4 
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_capture_config(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t capturex, uint32_t trgsource)
{
    switch (capturex)
    {
        /* configure the capture 0 unit */
        case SHRTIMER_CAPTURE_0:
        {
            SHRTIMER_STXCAP0TRG(shrtimer_periph, timer_id) = trgsource;
        }
        break;
        /* configure the capture 1 unit */
        case SHRTIMER_CAPTURE_1:
        {
            SHRTIMER_STXCAP1TRG(shrtimer_periph, timer_id) = trgsource;
        }
        break;
        default:
        break;
  }
}

/*!
    \brief      configure the capture source in Slave_TIMER  
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  capturex: SHRTIMER_CAPTURE_y(y=0, 1)
    \param[out] none
    \retval     none
*/
void shrtimer_slavetimer_capture_software(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t capturex)
{
    switch (capturex)
    {
        /* configure the capture 0 unit */
        case SHRTIMER_CAPTURE_0:
        {
            SHRTIMER_STXCAP0TRG(shrtimer_periph, timer_id) |= SHRTIMER_STXCAP0TRG_CP0BSW;
        }
        break;
        /* configure the capture 1 unit */
        case SHRTIMER_CAPTURE_1:
        {
            SHRTIMER_STXCAP1TRG(shrtimer_periph, timer_id) |= SHRTIMER_STXCAP1TRG_CP1BSW;
        }
        break;
        default:
        break;
  }
}

/*!
    \brief      read the capture value 
    \param[in]  shrtimer_periph: SHRTIMER0
    \param[in]  timer_id: SHRTIMER_SLAVE_TIMERx(x=0..4)
    \param[in]  capturex: SHRTIMER_CAPTURE_y(y=0, 1)
    \param[out] none
    \retval     capture value
*/
uint32_t shrtimer_slavetimer_capture_value_read(uint32_t shrtimer_periph, uint32_t timer_id, uint32_t capturex)
{
    uint32_t cap_val = 0;
    
